BAS BMEKZU Project/src/Catalogs/ИНАГРО_ГрафикиРаботы/ИНАГРО_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_ГрафикиРаботы</name>
  <predefined>
    <items>
      <name>Пятидневка</name>
      <description>Пятидневка</description>
    </items>
    <items>
      <name>Шестидневка</name>
      <description>Шестидневка</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидГрафика</name>
    <type>
      <types>EnumRef.ВидыРабочихГрафиков</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммированныйУчетРабочегоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйВыходной</name>
    <type>
      <types>EnumRef.ИНАГРО_ДниНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойВыходной</name>
    <type>
      <types>EnumRef.ИНАГРО_ДниНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочейНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетНормыВремениПоОтдельномуГрафику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыНормыВремени</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеполноеРабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Смены</name>
    <attributes>
      <name>НомерДня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.ИНАГРО_Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыВечерние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыНочные</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПериодыСмены</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблонЗаполнения</name>
    <attributes>
      <name>ДеньВключенВГрафик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_РегламентированныйПроизводственныйКалендарь/ИНАГРО_РегламентированныйПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_РегламентированныйПроизводственныйКалендарь</name>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/СпособыЗаполненияГрафикаРаботы/СпособыЗаполненияГрафикаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаполненияГрафикаРаботы</name>
  <enumValues>
    <name>ПоНеделям</name>
  </enumValues>
  <enumValues>
    <name>ПоЦикламПроизвольнойДлины</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ВидыРабочихГрафиков/ВидыРабочихГрафиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРабочихГрафиков</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Пятидневка</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Шестидневка</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Сменный</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыДнейПроизводственногоКалендаря/ИНАГРО_ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
    <comment>Рабочий день</comment>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_КлассификаторИспользованияРабочегоВремени/ИНАГРО_КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_КлассификаторИспользованияРабочегоВремени</name>
  <predefined>
    <items>
      <name>ГосударственныеОбязанности</name>
    </items>
    <items>
      <name>ПочасовкаСдельщиковВнутреннесменная</name>
    </items>
    <items>
      <name>ДетиДо18</name>
    </items>
    <items>
      <name>Карантин</name>
    </items>
    <items>
      <name>Опоздания</name>
    </items>
    <items>
      <name>СдельнаяРаботаПочасовыхРаботников</name>
    </items>
    <items>
      <name>ПочасовкаСдельщиков</name>
    </items>
    <items>
      <name>ДопризывнаяПодготовка</name>
    </items>
    <items>
      <name>ПростоиПоВинеРаботников</name>
    </items>
    <items>
      <name>ПреждевременноеОкончаниеРаботы</name>
    </items>
    <items>
      <name>УчебаБезСохраненияЗП</name>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателяВнутрисменный</name>
    </items>
    <items>
      <name>КомандировкаСельхозРаботы75</name>
    </items>
    <items>
      <name>ВоенныеСборы</name>
    </items>
    <items>
      <name>КомандировкаСельхозРаботы</name>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
    </items>
    <items>
      <name>ЖенщинамНаКормлениеДетей</name>
    </items>
    <items>
      <name>ПростоиПоВинеРаботниковВнутрисменные</name>
    </items>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>Работа</name>
      <description>01</description>
    </items>
    <items>
      <name>РаботаНеполныйРабочийДень</name>
      <description>02</description>
    </items>
    <items>
      <name>СверхурочныеСдельщиков</name>
      <description>03</description>
    </items>
    <items>
      <name>Вечерние</name>
      <description>03</description>
    </items>
    <items>
      <name>Ночные</name>
      <description>04</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>05</description>
    </items>
    <items>
      <name>РаботаВыходныеИПраздничные</name>
      <description>06</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>07</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>08</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>09</description>
    </items>
    <items>
      <name>ОтпускЧернобыльский</name>
      <description>10</description>
    </items>
    <items>
      <name>ОтпускТворческий</name>
      <description>11</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>12</description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>13</description>
    </items>
    <items>
      <name>ДополнительныйОтпускБезОплаты</name>
      <description>14</description>
    </items>
    <items>
      <name>ОтпускДополнительныйНаДетей</name>
      <description>15</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>16</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>17</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>18</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>19</description>
    </items>
    <items>
      <name>ПереводНаНеполныйДень</name>
      <description>20</description>
    </items>
    <items>
      <name>ПереводНаДругуюРаботу</name>
      <description>21</description>
    </items>
    <items>
      <name>НеотработанноеВремяПоЗаконодательству</name>
      <description>22</description>
    </items>
    <items>
      <name>Простой</name>
      <description>23</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>24</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>25</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>26</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>27</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>28</description>
    </items>
    <items>
      <name>ДругиеНеявкиПоКолДоговору</name>
      <description>29</description>
    </items>
    <items>
      <name>ДругиеНеявки</name>
      <description>30</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УважительнаяПричинаДляБольничных</name>
    <comment>Является уважительной причиной для расчета больничных</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_ГрафикиРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыГрафикаПоУмолчанию() Экспорт
	
	ДлительностьРабочейНедели = 40;
	УчитыватьПраздники = Истина;
	СпособЗаполнения = Перечисления.СпособыЗаполненияГрафикаРаботы.ПоНеделям;
	
	Для НомерДня = 1 По 7 Цикл
		
		СтрокаШаблона = ШаблонЗаполнения.Добавить();
		СтрокаШаблона.ДеньВключенВГрафик = НомерДня < 6;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеГрафика(ДанныеГрафика, НомерТекущегоГода) Экспорт
	
	КоличествоДнейВЦикле = ШаблонЗаполнения.Количество();

	Если КоличествоДнейВЦикле = 0 Тогда
		Возврат;
	КонецЕсли;	
			
	ДлинаСуток = 86400;
	
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный Тогда
		ДатаНачалаИнтервалаЗаполнения = Макс(Дата(НомерТекущегоГода, 1, 1), ДатаОтсчета);
		
	Иначе
		ДатаНачалаИнтервалаЗаполнения = Дата(НомерТекущегоГода, 1, 1);	
	КонецЕсли;	
	ДатаОкончанияИнтервалаЗаполнения = КонецГода(ДатаНачалаИнтервалаЗаполнения);
		
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка 
		ИЛИ ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка Тогда
		НомерДняЦикла = ДеньНедели(ДатаНачалаИнтервалаЗаполнения);
	Иначе
		НомерДняЦикла = ((ДатаНачалаИнтервалаЗаполнения - ДатаОтсчета)/ДлинаСуток) % КоличествоДнейВЦикле + 1;
	КонецЕсли;	
	
	ЧасыПоДнямЦикла = ИНАГРО_УчетРабочегоВремениКлиентСервер.ДанныеГрафикаЧасыПоДнямЦикла(ШаблонЗаполнения, Смены);
	
	ДанныеПроизводственногоКалендаря = РегистрыСведений.ИНАГРО_РегламентированныйПроизводственныйКалендарь.ДанныеПроизводственногоКалендаря(НомерТекущегоГода);
	
	ОбрабатываемаяДата = ДатаНачалаИнтервалаЗаполнения;
	ПредыдущаяДата = '00010101';
	
	ПеренесенныеДни = Новый Массив;
	Пока ОбрабатываемаяДата <= ДатаОкончанияИнтервалаЗаполнения  Цикл
		
		ДанныеПроизводственногоКалендаряЗаДень = ДанныеПроизводственногоКалендаря.Найти(ОбрабатываемаяДата, "ДатаКалендаря");
		
		Если ДанныеПроизводственногоКалендаряЗаДень = Неопределено Тогда
			ВидДня = Перечисления.ИНАГРО_ВидыДнейПроизводственногоКалендаря.Рабочий;
			ДатаПереноса = '00010101';
		Иначе
			ВидДня = ДанныеПроизводственногоКалендаряЗаДень.ВидДня;
			ДатаПереноса = ДанныеПроизводственногоКалендаряЗаДень.ДатаПереноса;
		КонецЕсли;	
		
		НомерДняМесяца = День(ОбрабатываемаяДата);
		
		Если Месяц(ОбрабатываемаяДата) <> Месяц(ПредыдущаяДата) Или ПредыдущаяДата = '00010101' Тогда
			СтрокиГрафикаПоВидамВремени = СтрокиТаблицыГрафикаЗаМесяц(ДанныеГрафика, Месяц(ОбрабатываемаяДата));			
		КонецЕсли;	
		
		Если Не ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный Тогда
	        Если ВидДня = Перечисления.ИНАГРО_ВидыДнейПроизводственногоКалендаря.Суббота Тогда
				ЧасовЗаДень = ЧасыПоДнямЦикла[6];
			ИначеЕсли ВидДня = Перечисления.ИНАГРО_ВидыДнейПроизводственногоКалендаря.Воскресенье Тогда
				ЧасовЗаДень = ЧасыПоДнямЦикла[7];
			ИначеЕсли ДатаПереноса <> '00010101' Тогда
				ЧасовЗаДень = ЧасыПоДнямЦикла[ДеньНедели(ДатаПереноса)];	
			Иначе
				ЧасовЗаДень = ЧасыПоДнямЦикла[НомерДняЦикла];
			КонецЕсли;
		Иначе
			ЧасовЗаДень = ЧасыПоДнямЦикла[НомерДняЦикла];	
		КонецЕсли;	
			
		Если (Не ВидДня = Перечисления.ИНАГРО_ВидыДнейПроизводственногоКалендаря.Праздник ИЛИ ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный)
			И ПеренесенныеДни.Найти(ОбрабатываемаяДата) = Неопределено Тогда
			
			ЗаполнитьВремяЗаДень(ОбрабатываемаяДата, ВидДня, ЧасовЗаДень, СтрокиГрафикаПоВидамВремени, ВидГрафика);
		КонецЕсли;
				
		ОбрабатываемаяДата = ОбрабатываемаяДата + ДлинаСуток;
		
		НомерДняЦикла = НомерДняЦикла + 1;
		Если НомерДняЦикла > КоличествоДнейВЦикле Тогда
			НомерДняЦикла = 1;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого СтрокаГрафика Из ДанныеГрафика Цикл
		ИНАГРО_УчетРабочегоВремениКлиентСервер.ДанныеГрафикаРассчитатьИтогоПоСтроке(СтрокаГрафика);
	КонецЦикла;	
	
КонецПроцедуры	

Функция СтрокиТаблицыГрафикаЗаМесяц(ДанныеГрафика, НомерМесяца)
	
	СтрокиПоВидамВремени = Новый Соответствие;
	
	СтрокиЗаМесяц = ДанныеГрафика.НайтиСтроки(Новый Структура("НомерМесяца", НомерМесяца));
	
	Для Каждого СтрокаТаблицы Из СтрокиЗаМесяц Цикл
		СтрокиПоВидамВремени.Вставить(СтрокаТаблицы.ВидВремени, СтрокаТаблицы);
	КонецЦикла;
	
	Возврат СтрокиПоВидамВремени;
	
КонецФункции

Процедура ЗаполнитьВремяЗаДень(ОбрабатываемаяДата, ВидДня, ЧасовЗаДень, СтрокиГрафикаПоВидамВремени, ВидГрафика = Неопределено)
	
	НомерДняМесяца = День(ОбрабатываемаяДата);
	
	Для Каждого ЧасыПоВидуВремени Из ЧасовЗаДень Цикл
		СтрокаТаблицыГрафика = СтрокиГрафикаПоВидамВремени.Получить(ЧасыПоВидуВремени.Ключ);	
		
		Если СтрокаТаблицыГрафика <> Неопределено Тогда
			СтрокаТаблицыГрафика["День" + НомерДняМесяца] = ЧасыПоВидуВремени.Значение;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидДня = Перечисления.ИНАГРО_ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
		
		ОсталосьВычестьЧасов = 1;
		ЧасовПоВидуВремени = ЧасовЗаДень.Получить(Справочники.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Работа);
			
		Если ЧасовПоВидуВремени <> Неопределено И ЧасовПоВидуВремени > 0 Тогда 
			СтрокаТаблицыГрафика = СтрокиГрафикаПоВидамВремени.Получить(Справочники.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Работа);
			
			Если СтрокаТаблицыГрафика <> Неопределено Тогда
				КоличествоВычитаемыхЧасов = Мин(СтрокаТаблицыГрафика["День" + НомерДняМесяца], 1);
				СтрокаТаблицыГрафика["День" + НомерДняМесяца] = СтрокаТаблицыГрафика["День" + НомерДняМесяца] - КоличествоВычитаемыхЧасов;
				
				ОсталосьВычестьЧасов = ОсталосьВычестьЧасов - КоличествоВычитаемыхЧасов;
			КонецЕсли;	
			
			Если ОсталосьВычестьЧасов <= 0 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	
	Возврат
КонецПроцедуры

Процедура ЗаписатьДанныеГрафика(ДанныеГрафика, НомерГода) Экспорт
	
	Записать();
	ДанныеПроизводственногоКалендаря = РегистрыСведений.ИНАГРО_РегламентированныйПроизводственныйКалендарь.ДанныеПроизводственногоКалендаря(НомерГода);
	ИНАГРО_УчетРабочегоВремени.ЗаписатьДанныеГрафика(Ссылка, ДанныеГрафика, НомерГода, ДанныеПроизводственногоКалендаря);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
